SecurityEvent
| where TimeGenerated > ago(1d)
| where ObjectName has_any (
  "\\Software\\Microsoft\\Windows\\CurrentVersion\\Run",
  "\\software\\Microsoft\\Windows NT\\CurrentVersion\\Windows\\Run",
  "\\software\\Wow6432Node\\Microsoft\\Windows NT\\CurrentVersion\\Windows\\Run",
  "\\software\\WOW6432Node\\Microsoft\\Windows\\CurrentVersion\\Run"
) or ObjectName has_any (
  "\\software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders",
  "\\software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\Userinit",
  "\\software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\Shell",
  "\\software\\Microsoft\\Windows NT\\CurrentVersion\\Windows\\AppInit_DLLs",
  "\\software\\Wow6432Node\\Microsoft\\Windows NT\\CurrentVersion\\Windows\\AppInit_DLLs",
  "\\software\\Microsoft\\Windows NT\\CurrentVersion\\Windows\\Load",
  "\\software\\Wow6432Node\\Microsoft\\Windows NT\\CurrentVersion\\Windows\\Load"
)
| where not(Process has_any (
  "\\Microsoft Visual Studio\\Installer\\",
  "\\ClickToRun\\OfficeClickToRun.exe",
  "\\software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\Shell",
  "\\Microsoft\\OneDrive\\" "\\Windows\\system32\\SearchIndexer.exe"
))
| project TimeGenerated, Computer, Process, ObjectName, ObjectValueName, NewValue, OldValue, SubjectUserName, NewProcessId  
| order by TimeGenerated
