let processList = dynamic(["arp.exe","at.exe","attrib.exe","cscript.exe","dsquery.exe","hostname.exe","ipconfig.exe","mimikatz.exe","nbtstat.exe","net.exe","netsh.exe","nslookup.exe","ping.exe","quser.exe","qwinsta.exe","reg.exe","runas.exe","sc.exe","schtasks.exe","ssh.exe","systeminfo.exe","taskkill.exe","telnet.exe","tracert.exe","wscript.exe","xcopy.exe","pscp.exe","copy.exe","robocopy.exe","certutil.exe","vssadmin.exe","powershell.exe","wevtutil.exe","psexec.exe","bcedit.exe","wbadmin.exe","icacls.exe","diskpart.exe","ver.exe","netstat.exe","tasklist.exe","route.exe","driverquery.exe"]);
SecurityEvent
| where NewProcessName has_any (processList)
| summarize firstEvent=min(TimeGenerated), lastEvent=max(TimeGenerated), processList=make_list(NewProcessName), uniqueProcesses=dcount(NewProcessName), eventIds=make_set(tostring(EventID)), processPaths=make_set(NewProcessName), processCommandLines=make_set(CommandLine), parentProcessPaths=make_set(ParentProcessName), processIds=make_set(NewProcessId), parentprocessIds=make_set(ProcessId), eventData=make_set(EventData), count() by bin(TimeGenerated, 5m), SourceComputerId, Computer| order by firstEvent
| where uniqueProcesses > 4
