SecurityEvent
| where ParentProcessName has "explorer.exe" 
| where Process has_any (
  "wscript.exe",
  "rundll32.exe",
  "explorer.exe",
  "cmd.exe"
  )
| where (CommandLine has_any (
  "explorer",
  "rundll32"
  ) and CommandLine has_any (
  ".dll,",
  ".dll "
  )) or (CommandLine has "cmd.exe" and CommandLine matches regex "\\/[Cc] +[Ss][Tt][Aa][Rr][Tt].*\\.exe")
| project TimeGenerated, Computer, tostring(EventID), ParentProcessName, NewProcessName, CommandLine, SubjectUserName, SourceComputerId, processID=tolong(NewProcessId), parentProcessID=tolong(ProcessId), EventData| order by TimeGenerated
