// Setting the timestamp parameters to use the ago() function
set query_datetimescope_column = "TimeGenerated";
set query_datetimescope_to = datetime(2023-09-14 14:10:00);
set query_now = datetime(2023-09-14 14:10:00);
// Actual query
SecurityEvent
| where TimeGenerated > ago(48h)
| where EventID == 4624           //set succesful logon event id
| summarize unique_computer_count = dcount(Computer) by TargetUserName
| where unique_computer_count > 3     // set the number of devices, 
